IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DMASS0_PKTDMA_0_PKTDMA_GCFG.xml
<module name="DMASS0_PKTDMA_0_PKTDMA_GCFG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="PKTDMA_GCFG_REVISION" acronym="PKTDMA_GCFG_REVISION" offset="0x0" width="32" description="The Revision Register contains the major and minor revisions for the module.">
		<bitfield id="MODID" width="16" begin="31" end="16" resetval="0x26154" description="Module ID field" range="31 - 16" rwaccess="R"/> 
		<bitfield id="REVRTL" width="5" begin="15" end="11" resetval="0x8" description="RTL revision. Will vary depending on release." range="15 - 11" rwaccess="R"/> 
		<bitfield id="REVMAJ" width="3" begin="10" end="8" resetval="0x1" description="Major revision" range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom" range="7 - 6" rwaccess="R"/> 
		<bitfield id="REVMIN" width="6" begin="5" end="0" resetval="0x1" description="Minor revision" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="PKTDMA_GCFG_PERF_CTRL" acronym="PKTDMA_GCFG_PERF_CTRL" offset="0x4" width="32" description="The performance control register contains fields which can be used to adjust the performance of the PKTDMA in the system.">
		<bitfield id="TIMEOUT_CNT" width="16" begin="15" end="0" resetval="0x64" description="This feature is not currently supported" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PKTDMA_GCFG_EMU_CTRL" acronym="PKTDMA_GCFG_EMU_CTRL" offset="0x8" width="32" description="The emulation control register is used to control the behavior of the DMA when the emususp input is asserted.">
		<bitfield id="SOFT" width="1" begin="1" end="1" resetval="0x0" description="Soft" range="1" rwaccess="R/W"/> 
		<bitfield id="FREE" width="1" begin="0" end="0" resetval="0x0" description="Free" range="0" rwaccess="R/W"/>
	</register>
	<register id="PKTDMA_GCFG_PSIL_TO" acronym="PKTDMA_GCFG_PSIL_TO" offset="0x10" width="32" description="The PSI-L proxy timeout register controls the timeout watchdog and reports timeout occurrances on PSI-L configuration transactions issued by the built in PSI-L proxy.">
		<bitfield id="TOUT" width="1" begin="31" end="31" resetval="0x0" description="Timeout occurred.  When set indicates that a timeout has occurred on a config access" range="31" rwaccess="R/W"/> 
		<bitfield id="TOUT_CNT" width="16" begin="15" end="0" resetval="0x1024" description="Timeout period.  Specifies how many cycles to wait before closing up a conifiguration read or write transaction and asserting the tout bit" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PKTDMA_GCFG_CAP0" acronym="PKTDMA_GCFG_CAP0" offset="0x20" width="32" description="The Capabilities Register 0 specifies which standard features this PKTDMA instance supports.">
		
	</register>
	<register id="PKTDMA_GCFG_CAP1" acronym="PKTDMA_GCFG_CAP1" offset="0x24" width="32" description="The Capabilities Register 1 specifies which standard features this PKTDMA instance supports.">
		
	</register>
	<register id="PKTDMA_GCFG_CAP2" acronym="PKTDMA_GCFG_CAP2" offset="0x28" width="32" description="The Capabilities Register 2 specifies how many resources this PKTDMA instance supports.">
		<bitfield id="RCHAN_CNT" width="9" begin="26" end="18" resetval="0x29" description="Rx internal channel count" range="26 - 18" rwaccess="R"/> 
		<bitfield id="TCHAN_CNT" width="9" begin="8" end="0" resetval="0x42" description="Tx internal channel count" range="8 - 0" rwaccess="R"/>
	</register>
	<register id="PKTDMA_GCFG_CAP3" acronym="PKTDMA_GCFG_CAP3" offset="0x2C" width="32" description="The Capabilities Register 3 specifies how many resources this PKTDMA instance supports.">
		<bitfield id="UCHAN_CNT" width="9" begin="31" end="23" resetval="0x0" description="Tx ultra high capacity internal channel count" range="31 - 23" rwaccess="R"/> 
		<bitfield id="HCHAN_CNT" width="9" begin="22" end="14" resetval="0x0" description="Tx high capacity internal channel count" range="22 - 14" rwaccess="R"/> 
		<bitfield id="RFLOW_CNT" width="14" begin="13" end="0" resetval="0x176" description="Rx flow table entry count" range="13 - 0" rwaccess="R"/>
	</register>
	<register id="PKTDMA_GCFG_CAP4" acronym="PKTDMA_GCFG_CAP4" offset="0x30" width="32" description="The Capabilities Register 4 specifies how many resources this PKTDMA instance supports.">
		<bitfield id="TFLOW_CNT" width="14" begin="13" end="0" resetval="0x112" description="Tx flow table entry count" range="13 - 0" rwaccess="R"/>
	</register>
	<register id="PKTDMA_GCFG_PM0" acronym="PKTDMA_GCFG_PM0" offset="0x60" width="32" description="This register enables or inhibits automatic clock gating to individual sub-blocks">
		<bitfield id="NOGATE_RDU3" width="1" begin="31" end="31" resetval="0x0" description="When set inhibits automatic gating of clock." range="31" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RDU2" width="1" begin="30" end="30" resetval="0x0" description="When set inhibits automatic gating of clock." range="30" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RDU1" width="1" begin="29" end="29" resetval="0x0" description="When set inhibits automatic gating of clock." range="29" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RDU0" width="1" begin="28" end="28" resetval="0x0" description="When set inhibits automatic gating of clock." range="28" rwaccess="R/W"/> 
		<bitfield id="NOGATE_TDU3" width="1" begin="27" end="27" resetval="0x0" description="When set inhibits automatic gating of clock." range="27" rwaccess="R/W"/> 
		<bitfield id="NOGATE_TDU2" width="1" begin="26" end="26" resetval="0x0" description="When set inhibits automatic gating of clock." range="26" rwaccess="R/W"/> 
		<bitfield id="NOGATE_TDU1" width="1" begin="25" end="25" resetval="0x0" description="When set inhibits automatic gating of clock." range="25" rwaccess="R/W"/> 
		<bitfield id="NOGATE_TDU0" width="1" begin="24" end="24" resetval="0x0" description="When set inhibits automatic gating of clock." range="24" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RSVD4" width="11" begin="23" end="13" resetval="0x0" description="Reserved PM signals." range="23 - 13" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RDEC" width="1" begin="12" end="12" resetval="0x0" description="When set inhibits automatic gating of clock." range="12" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RSVD3" width="3" begin="11" end="9" resetval="0x0" description="Reserved PM signals." range="11 - 9" rwaccess="R/W"/> 
		<bitfield id="NOGATE_SDEC" width="1" begin="8" end="8" resetval="0x0" description="When set inhibits automatic gating of clock." range="8" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RSVD2" width="3" begin="7" end="5" resetval="0x0" description="Reserved PM signals." range="7 - 5" rwaccess="R/W"/> 
		<bitfield id="NOGATE_WARB" width="1" begin="4" end="4" resetval="0x0" description="When set inhibits automatic gating of clock." range="4" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RSVD1" width="3" begin="3" end="1" resetval="0x0" description="Reserved PM signals." range="3 - 1" rwaccess="R/W"/> 
		<bitfield id="NOGATE_CARB" width="1" begin="0" end="0" resetval="0x0" description="When set inhibits automatic gating of clock." range="0" rwaccess="R/W"/>
	</register>
	<register id="PKTDMA_GCFG_PM1" acronym="PKTDMA_GCFG_PM1" offset="0x64" width="32" description="This register enables or inhibits automatic clock gating to individual sub-blocks">
		<bitfield id="NOGATE_RSVD12" width="1" begin="31" end="31" resetval="0x0" description="Reserved PM signals." range="31" rwaccess="R/W"/> 
		<bitfield id="NOGATE_STATS" width="1" begin="30" end="30" resetval="0x0" description="When set inhibits automatic gating of clock." range="30" rwaccess="R/W"/> 
		<bitfield id="NOGATE_PROXY" width="1" begin="29" end="29" resetval="0x0" description="When set inhibits automatic gating of clock." range="29" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RSVD11" width="1" begin="28" end="28" resetval="0x0" description="Reserved PM signals." range="28" rwaccess="R/W"/> 
		<bitfield id="NOGATE_P2P" width="1" begin="27" end="27" resetval="0x0" description="When set inhibits automatic gating of clock." range="27" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RSVD10" width="1" begin="26" end="26" resetval="0x0" description="Reserved PM signals." range="26" rwaccess="R/W"/> 
		<bitfield id="NOGATE_EHANDLER" width="1" begin="25" end="25" resetval="0x0" description="When set inhibits automatic gating of clock." range="25" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RINGOCC" width="1" begin="24" end="24" resetval="0x0" description="When set inhibits automatic gating of clock." range="24" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RSVD9" width="1" begin="23" end="23" resetval="0x0" description="Reserved PM signals." range="23" rwaccess="R/W"/> 
		<bitfield id="NOGATE_TPCF" width="1" begin="22" end="22" resetval="0x0" description="When set inhibits automatic gating of clock." range="22" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RSVD8" width="3" begin="21" end="19" resetval="0x0" description="Reserved PM signals." range="21 - 19" rwaccess="R/W"/> 
		<bitfield id="NOGATE_CFG" width="1" begin="18" end="18" resetval="0x0" description="When set inhibits automatic gating of clock." range="18" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RSVD7" width="2" begin="17" end="16" resetval="0x0" description="Reserved PM signals." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RFLOWFW" width="1" begin="15" end="15" resetval="0x0" description="When set inhibits automatic gating of clock." range="15" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RSVD6" width="1" begin="14" end="14" resetval="0x0" description="Reserved PM signals." range="14" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RCU" width="1" begin="13" end="13" resetval="0x0" description="When set inhibits automatic gating of clock." range="13" rwaccess="R/W"/> 
		<bitfield id="NOGATE_TCU" width="1" begin="12" end="12" resetval="0x0" description="When set inhibits automatic gating of clock." range="12" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RSVD5" width="12" begin="11" end="0" resetval="0x0" description="Reserved PM signals." range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="PKTDMA_GCFG_DBGA" acronym="PKTDMA_GCFG_DBGA" offset="0x78" width="32" description="This register provides a writable address which allows debug information to be read from the Debug Data Register">
		<bitfield id="DBG_EN" width="1" begin="31" end="31" resetval="0x0" description="Debug enable" range="31" rwaccess="R/W"/> 
		<bitfield id="DBG_UNIT" width="8" begin="15" end="8" resetval="0x0" description="Selects which unit to read debug information from" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="DBG_ADDR" width="8" begin="7" end="0" resetval="0x0" description="Selects offset within unit to access seperate debug registers" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PKTDMA_GCFG_DBGD" acronym="PKTDMA_GCFG_DBGD" offset="0x7C" width="32" description="This register provides read only debug data">
		<bitfield id="DBG_DATA" width="32" begin="31" end="0" resetval="0x0" description="Provides debug information from various internal units.  The value which is read back depends on which unit and register are selected in the Debug Address Register" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PKTDMA_GCFG_RFLOWFWSTAT" acronym="PKTDMA_GCFG_RFLOWFWSTAT" offset="0x88" width="32" description="The Rx Flow FW Status Register 0 captures information about the thread/channel and received flow ID which failed a range check.  Values in this register will remain persistent once an exception has been detected until the pend bit is written back to 0">
		<bitfield id="PEND" width="1" begin="31" end="31" resetval="0x0" description="This bit is set whenever the Flow ID firewall detects a Flow ID is out of range for an incoming packet.  Once this bit is set, the remaining fields in this register will not be modified.  SW is required to write this bit to 0 to allow another exception to be captured." range="31" rwaccess="R/W"/> 
		<bitfield id="FLOWID" width="14" begin="29" end="16" resetval="0x0" description="This is the flow ID that was received on the trapped packet" range="29 - 16" rwaccess="R/W"/> 
		<bitfield id="CHANNEL" width="9" begin="8" end="0" resetval="0x0" description="This is the channel number on which the trapped packet was received" range="8 - 0" rwaccess="R/W"/>
	</register>
</module>